Repository: Zayrick/UniLLMs
Catalog: UniLLMs/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# about.email.title
source: Email
zh_hans: 联系邮箱

# about.license.detail
source: GNU Affero General Public License v3.0.
zh_hans: GNU Affero 通用公共许可证第 3 版。

# about.license.title
source: Open Source License
zh_hans: 开源协议

# about.open_source.title
source: Open Source
zh_hans: 开源地址

# about.privacy_policy.detail
source: How UniLLMs handles local data, providers, tools, and permissions.
zh_hans: 说明 UniLLMs 如何处理本地数据、服务商、工具与权限。

# about.privacy_policy.title
source: Privacy Policy
zh_hans: 隐私政策

# about.section.contact
source: Contact
zh_hans: 联系

# about.section.legal
source: Legal
zh_hans: 法律

# about.summary.detail
source: An AGPLv3 open-source LLM chat client for configuring providers, conversations, memories, prompts, tools, and attachments on device.
zh_hans: 一款采用 AGPLv3 开源协议的 LLM 对话客户端，用于在设备上配置模型服务商、对话、记忆、提示词、工具与附件。

# about.title
source: About UniLLMs
zh_hans: 关于 UniLLMs

# assistant.copy_raw
source: Copy Raw Content
zh_hans: 复制原始内容

# assistant.processing
source: Processing
zh_hans: 处理中

# assistant.reasoning_step.plural
source: reasoning steps
zh_hans: 步推理

# assistant.reasoning_step.singular
source: reasoning step
zh_hans: 步推理

# assistant.tool_call.plural
source: tool calls
zh_hans: 次工具调用

# assistant.tool_call.singular
source: tool call
zh_hans: 次工具调用

# assistant.tool.failed_format
source: %@ failed
zh_hans: %@ 执行失败

# assistant.tool.shows_details
source: Shows tool details
zh_hans: 显示工具详情

# assistant.tool.using_format
source: Using %@
zh_hans: 正在调用 %@

# background_runtime.error.registration_failed_format
source: Unable to register background response task %@. Check BGTaskSchedulerPermittedIdentifiers.
zh_hans: 无法注册后台回复任务 %@。请检查 BGTaskSchedulerPermittedIdentifiers。

# background_runtime.error.submission_failed_format
source: Unable to start background response task: %@
zh_hans: 无法启动后台回复任务：%@

# background_runtime.task.subtitle.generating_response
source: Generating response
zh_hans: 正在生成回复

# chat.attachment
source: Attachment
zh_hans: 附件

# chat.attachment.camera_unavailable
source: Camera is not available on this device.
zh_hans: 此设备没有可用相机。

# chat.attachment.file_missing
source: The attachment file is missing.
zh_hans: 附件文件已丢失。

# chat.attachment.file_missing_on_disk
source: The attachment file is missing on disk.
zh_hans: 本地附件文件已丢失。

# chat.attachment.image_filename_format
source: Image-%ld
zh_hans: 图片-%ld

# chat.attachment.more_count_format
source: %ld more attachments
zh_hans: 另有 %ld 个附件

# chat.attachment.photo_encoding_failed
source: Could not encode the captured photo.
zh_hans: 无法处理刚拍摄的照片。

# chat.attachment.photo_filename_format
source: Photo-%@
zh_hans: 照片-%@

# chat.attachment.preview_unavailable
source: This file type cannot be previewed.
zh_hans: 此文件类型无法预览。

# chat.copy
source: Copy
zh_hans: 复制

# chat.edit_and_resend
source: Edit & Resend
zh_hans: 编辑并重发

# chat.edit_message
source: Edit Message
zh_hans: 编辑消息

# chat.generating_response
source: Generating response
zh_hans: 正在生成回复

# chat.history_count_format
source: History (%ld)
zh_hans: 历史记录（%ld）

# chat.menu
source: Menu
zh_hans: 菜单

# chat.message_unavailable
source: The message is no longer available.
zh_hans: 此消息已不可用。

# chat.new_chat
source: New Chat
zh_hans: 新对话

# chat.no_chats
source: No Chats
zh_hans: 暂无对话

# chat.private_chat
source: Private Chat
zh_hans: 隐私对话

# chat.private_chat_active
source: Private Chat On
zh_hans: 隐私模式已开启

# chat.private_chat_active_hint
source: Leaves private mode and discards this chat.
zh_hans: 退出隐私模式并丢弃本次对话。

# chat.private_chat_hint
source: Starts a chat that will not be saved.
zh_hans: 开始一段不会保存的对话。

# chat.resend
source: Resend
zh_hans: 重发

# chat.response_in_progress
source: Wait for the current response to finish.
zh_hans: 请等待当前回复完成。

# chat.select_model
source: Select Model
zh_hans: 选择模型

# composer_add.camera
source: Camera
zh_hans: 相机

# composer_add.camera.description
source: Take a new photo.
zh_hans: 拍照。

# composer_add.files
source: Files
zh_hans: 文件

# composer_add.files.description
source: Attach files.
zh_hans: 添加文件。

# composer_add.photos
source: Photos
zh_hans: 照片

# composer_add.photos.description
source: Choose photos.
zh_hans: 选择照片。

# composer_add.system_prompt
source: System Prompt
zh_hans: 系统提示词

# composer_add.system_prompt.description
source: Choose reusable instructions.
zh_hans: 选择可复用指令。

# composer.message_placeholder
source: Message
zh_hans: 输入消息

# composer.remove_attachment
source: Remove attachment
zh_hans: 移除附件

# composer.remove_system_prompt
source: Remove system prompt
zh_hans: 移除系统提示词

# composer.stop_generating
source: Stop generating
zh_hans: 停止生成

# composer.waveform
source: Waveform
zh_hans: 波形

# general.add
source: Add
zh_hans: 添加

# general.cancel
source: Cancel
zh_hans: 取消

# general.clear
source: Clear
zh_hans: 清除

# general.close
source: Close
zh_hans: 关闭

# general.collapsed
source: Collapsed
zh_hans: 已折叠

# general.copied
source: Copied
zh_hans: 已复制

# general.delete
source: Delete
zh_hans: 删除

# general.expanded
source: Expanded
zh_hans: 已展开

# general.history
source: History
zh_hans: 历史记录

# general.more
source: More
zh_hans: 更多

# general.ok
source: OK
zh_hans: 好

# general.opens_preview
source: Opens a preview
zh_hans: 打开预览

# general.save
source: Save
zh_hans: 保存

# general.search
source: Search
zh_hans: 搜索

# general.send
source: Send
zh_hans: 发送

# general.settings
source: Settings
zh_hans: 设置

# general.updated_format
source: Updated %@
zh_hans: 更新于 %@

# json.error.unsupported_content_part_type_format
source: Unsupported content part type: %@
zh_hans: 不支持的内容片段类型：%@

# json.error.unsupported_message_content_payload
source: Unsupported message content payload.
zh_hans: 不支持的消息内容。

# json.error.unsupported_value
source: Unsupported JSON value.
zh_hans: 不支持的 JSON 值。

# mcp.connection
source: Connection
zh_hans: 连接

# mcp.enable_server
source: Enable Server
zh_hans: 启用服务器

# mcp.endpoint
source: Endpoint
zh_hans: 端点

# mcp.error.http_status_format
source: %@ returned HTTP %ld.
zh_hans: %1$@ 返回 HTTP %2$ld。

# mcp.error.http_status_message_format
source: %@ returned HTTP %ld: %@
zh_hans: %1$@ 返回 HTTP %2$ld：%3$@

# mcp.error.invalid_endpoint_format
source: Invalid MCP endpoint: %@
zh_hans: MCP 端点无效：%@

# mcp.error.invalid_response_format
source: %@ returned an invalid MCP response.
zh_hans: %@ 返回的 MCP 响应无效。

# mcp.error.rpc_format
source: MCP JSON-RPC %ld: %@
zh_hans: MCP JSON-RPC %1$ld：%2$@

# mcp.headers
source: Headers
zh_hans: 请求头

# mcp.name
source: Name
zh_hans: 名称

source: MCP Server
zh_hans: MCP 服务器

# mcp.server_summary_format
source: Server: %@
zh_hans: 服务器：%@

# mcp.timeout
source: Timeout
zh_hans: 超时时间

# mcp.tool.failed_no_output
source: Tool execution failed with no output.
zh_hans: 工具执行失败，且没有输出。

# mcp.tool.succeeded_no_output
source: Tool executed successfully with no output.
zh_hans: 工具执行成功，但没有输出。

# memories.accessibility.injection_filter
source: Memory injection filter
zh_hans: 记忆注入范围

# memories.accessibility.injection_limit
source: Memory injection limit
zh_hans: 记忆注入数量

# memories.add_memory
source: Add Memory
zh_hans: 添加记忆

# memories.clear_all
source: Clear All Memories
zh_hans: 清除全部记忆

# memories.clear_all.confirmation.count.message_format
source: This deletes all %ld saved memories from this device.
zh_hans: 将从此设备删除 %ld 条记忆。

# memories.clear_all.confirmation.one.message
source: This deletes the saved memory from this device.
zh_hans: 将从此设备删除这条记忆。

# memories.clear_all.confirmation.title
source: Clear All Memories?
zh_hans: 清除全部记忆？

# memories.clear_memories
source: Clear Memories
zh_hans: 清除记忆

# memories.count_format
source: %ld saved memories
zh_hans: %ld 条记忆

# memories.count.none
source: No saved memories
zh_hans: 暂无记忆

# memories.count.one
source: 1 saved memory
zh_hans: 1 条记忆

# memories.empty.no_matching.detail
source: Try another word or phrase.
zh_hans: 请尝试其他词语。

# memories.empty.no_matching.title
source: No Matching Memories
zh_hans: 未找到匹配记忆

# memories.empty.no_saved.detail
source: Add a memory when needed.
zh_hans: 需要时添加记忆。

# memories.empty.no_saved.title
source: No Saved Memories
zh_hans: 暂无记忆

# memories.error.empty_argument_format
source: Argument cannot be empty: %@.
zh_hans: 参数不能为空：%@。

# memories.error.invalid_limit_format
source: Argument must be an integer from 1 through %ld: %@.
zh_hans: 参数必须是 1 到 %1$ld 之间的整数：%2$@。

# memories.error.invalid_uuid_format
source: Argument must be a valid UUID: %@.
zh_hans: 参数必须是有效 UUID：%@。

# memories.error.missing_argument_format
source: Missing required argument: %@.
zh_hans: 缺少必需参数：%@。

# memories.error.missing_memory_format
source: No memory exists for id %@.
zh_hans: ID 为 %@ 的记忆不存在。

# memories.error.storage_unavailable
source: Memory storage is not available.
zh_hans: 记忆存储不可用。

# memories.filter.all_time
source: All Time
zh_hans: 不限时间

# memories.filter.last_7_days
source: Last 7 Days
zh_hans: 过去 7 天

# memories.filter.last_24_hours
source: Last 24 Hours
zh_hans: 过去 24 小时

# memories.filter.last_30_days
source: Last 30 Days
zh_hans: 过去 30 天

# memories.filter.last_90_days
source: Last 90 Days
zh_hans: 过去 90 天

# memories.filter.last_year
source: Last Year
zh_hans: 过去一年

# memories.filter.smart
source: Smart
zh_hans: 智能

# memories.footer.requires_tools
source: Requires Tools.
zh_hans: 需启用工具。

# memories.inject_memories
source: Inject Memories
zh_hans: 注入记忆

# memories.memory
source: Memory
zh_hans: 记忆

# memories.memory_filter
source: Memory Filter
zh_hans: 记忆范围

# memories.memory_limit
source: Memory Limit
zh_hans: 记忆数量

# memories.memory.placeholder
source: I prefer concise answers.
zh_hans: 我偏好简洁回答。

# memories.new_memory
source: New Memory
zh_hans: 新记忆

# memories.no_limit
source: No Limit
zh_hans: 不限制

# memories.saved_memories
source: Saved Memories
zh_hans: 已存记忆

# memories.search_saved_memories
source: Search saved memories
zh_hans: 搜索记忆

# memories.section.assistant_access
source: Assistant Access
zh_hans: 助手访问权限

# memories.section.injection
source: Memory Injection
zh_hans: 记忆注入

# memories.untitled_memory
source: Untitled Memory
zh_hans: 未命名记忆

# model_selection.no_matches
source: No Matches
zh_hans: 无匹配结果

# model_selection.no_matches.detail
source: Try another model name, model ID, or provider.
zh_hans: 请尝试其他模型名称、模型 ID 或服务商。

# model_selection.no_models.manual.detail
source: Add models for this provider in Settings.
zh_hans: 请在设置中为此服务商添加模型。

# model_selection.no_models.remote.detail
source: Refresh the model list for this provider in Settings.
zh_hans: 请在设置中刷新此服务商的模型列表。

# model_selection.no_models.static.detail
source: This provider does not include static models.
zh_hans: 此服务商没有静态模型。

# model_selection.no_models.unknown.detail
source: Add provider models in Settings.
zh_hans: 请在设置中添加服务商模型。

# model_selection.no_providers
source: No LLM Providers
zh_hans: 暂无模型服务商

# model_selection.no_providers.detail
source: Add a provider in Settings before selecting a model.
zh_hans: 请先在设置中添加模型服务商。

# model_selection.search_models
source: Search Models
zh_hans: 搜索模型

# permissions.calendar.detail
source: Used by calendar tools to read, create, update, and delete events only when invoked.
zh_hans: 仅在调用日历工具时用于读取、创建、更新和删除事件。

# permissions.calendar.title
source: Calendar Events
zh_hans: 日历事件

# permissions.camera.detail
source: Take a photo for chat.
zh_hans: 拍照添加到当前对话。

# permissions.camera.title
source: Camera
zh_hans: 相机

# permissions.open_settings.detail
source: Manage this app's system permissions.
zh_hans: 管理此 App 的系统权限。

# permissions.open_settings.title
source: App Settings
zh_hans: App 设置

# permissions.photos_picker.detail
source: Attach selected photos to chat.
zh_hans: 把你选中的照片添加到对话。

# permissions.photos_picker.title
source: Photo Picker
zh_hans: 照片选择器

# permissions.section.calendar
source: Calendar
zh_hans: 日历

# permissions.section.media
source: Media
zh_hans: 媒体

# permissions.section.shortcuts
source: System
zh_hans: 系统

# permissions.status.authorized
source: Allowed
zh_hans: 已允许

# permissions.status.denied
source: Disabled
zh_hans: 已禁用

# permissions.status.full_access
source: Full Access
zh_hans: 完整访问

# permissions.status.not_determined
source: Not Requested
zh_hans: 未请求

# permissions.status.not_required
source: Not Required
zh_hans: 无需授权

# permissions.status.restricted
source: Restricted
zh_hans: 受限制

# permissions.status.unavailable
source: Unavailable
zh_hans: 不可用

# permissions.status.unknown
source: Unknown
zh_hans: 未知

# permissions.status.write_only
source: Write Only
zh_hans: 仅写入

# permissions.title
source: Permissions
zh_hans: 权限

# privacy.body
source: Privacy Policy Last updated: June 8, 2026 1. Scope This policy applies to UniLLMs for iOS. UniLLMs is an AGPLv3 open-source LLM chat client that lets you configure model providers, conversations, memories, prompts, tools, MCP servers, and attachments on your device. 2. Data We Do Not Collect The UniLLMs project and its maintainers do not operate an analytics service for this app and do not collect personal information, usage telemetry, advertising identifiers, crash reports, or diagnostic logs from your device. The app does not use tracking for advertising or profiling. 3. Data Stored Locally Your conversations, provider configurations, API keys, model metadata, memories, system prompts, tool settings, MCP server settings, and app preferences are stored on your device using Apple platform storage. This information remains under your control unless you choose to send it to a configured service or include it in an Apple backup, device transfer, or other system-level service you enable. 4. Cloud Model Providers and Tools When you send a message through a cloud or OpenAI-compatible provider, UniLLMs sends the selected conversation content and the required context to the provider you configured. This may include messages, attachments, system prompts, memory context, tool definitions, tool results, and model settings needed to complete the request. The provider processes that data under its own terms and privacy policy. Built-in providers may include OpenRouter, OpenAI, Anthropic, Gemini, Pollinations, or other OpenAI-compatible services you add. 5. User-Configured Integrations If you configure MCP servers, custom API bases, or third-party tools, UniLLMs may send requests and receive responses from those endpoints as part of the features you enable. You are responsible for reviewing the trustworthiness, access controls, logging behavior, retention terms, and privacy policies of services you configure. 6. Media, Calendar, and Permissions UniLLMs accesses camera or photo picker content only when you choose to attach media in a conversation and grant the relevant system permission. Selected media may be stored locally with the conversation and may be sent to the selected model provider when included in a request. Calendar tools may request permission to read, create, update, or delete events only when enabled and invoked. Calendar events read or changed by a tool, and confirmations for calendar changes, may be sent to the selected model provider as tool results when needed to complete a request. 7. Security UniLLMs avoids logging secrets or full authorization headers in application code. You should still protect your device, backups, API keys, and configured endpoints. Do not enter secrets into providers or tools you do not trust. 8. Open Source, License, and Contact The UniLLMs application source code is available at https://github.com/Zayrick/UniLLMs under the GNU Affero General Public License v3.0 (AGPL-3.0). The license governs the software code; any personal provider configurations, API keys, prompts, memories, conversations, or attachments you create remain your own content unless you choose to share them. For privacy questions, contact tvefxt@gmail.com. 9. Policy Updates We may update this policy as the app changes. Updated text will be provided in the app or project repository.
zh_hans: 隐私政策 最后更新：2026年6月8日 一、适用范围 本政策适用于 UniLLMs iOS App。UniLLMs 是一款采用 AGPLv3 开源协议的 LLM 对话客户端，用于在你的设备上配置模型服务商、对话、记忆、提示词、工具、MCP 服务和附件。 二、我们不收集的数据 UniLLMs 项目及维护者不为本 App 运营分析服务，也不会从你的设备收集个人信息、使用遥测、广告标识符、崩溃报告或诊断日志。本 App 不用于广告追踪或画像。 三、本地存储的数据 你的对话、服务商配置、API 密钥、模型元数据、记忆、系统提示词、工具设置、MCP 服务设置和 App 偏好会使用 Apple 平台存储保存在你的设备上。除非你主动发送给已配置服务，或通过你启用的 Apple 备份、设备迁移等系统级服务处理，否则这些信息由你控制。 四、云端模型服务与工具 当你通过云端或 OpenAI 兼容服务商发送消息时，UniLLMs 会将选定对话内容及完成请求所需的上下文发送给你配置的服务商。这可能包括消息、附件、系统提示词、记忆上下文、工具定义、工具结果和模型设置。服务商将根据其自身条款和隐私政策处理这些数据。内置或可配置的服务可能包括 OpenRouter、OpenAI、Anthropic、Gemini、Pollinations 或你添加的其他 OpenAI 兼容服务。 五、用户配置的集成 如果你配置 MCP 服务、自定义 API 地址或第三方工具，UniLLMs 会在你启用相关功能时与这些端点收发请求。你需要自行审查所配置服务的可信度、访问控制、日志行为、保留期限及隐私政策。 六、媒体、日历与权限 UniLLMs 仅在你主动为对话添加媒体并授权相关系统权限时访问相机或照片选择器内容。你选择的媒体可能随对话保存在本地，也可能在被纳入请求时发送给所选模型服务商。日历工具仅在你启用并调用时申请读取、创建、更新或删除事件的权限。工具读取或更改的日历事件，以及日历变更的确认结果，可能作为工具结果发送给所选模型服务商，用于完成你的请求。 七、安全 UniLLMs 的应用代码会避免记录密钥或完整授权头。你仍应妥善保护设备、备份、API 密钥和已配置端点。请不要把密钥输入给你不信任的服务商或工具。 八、开源、协议与联系 UniLLMs 应用源码以 GNU Affero 通用公共许可证第 3 版（AGPL-3.0）开源，地址为 https://github.com/Zayrick/UniLLMs。该协议约束软件代码；你创建的个人服务商配置、API 密钥、提示词、记忆、对话或附件仍属于你自己的内容，除非你选择分享。隐私相关问题可通过 tvefxt@gmail.com 联系。 九、政策更新 我们可能会随 App 变化更新本政策。更新后的文本会在 App 或项目仓库中提供。

# privacy.title
source: Privacy Policy
zh_hans: 隐私政策

# provider_configuration.add_model
source: Add Model
zh_hans: 添加模型

# provider_configuration.error.unable_to_refresh_models
source: Unable to Refresh Models
zh_hans: 无法刷新模型

# provider_configuration.model_count_format
source: %ld Models
zh_hans: %ld 个模型

# provider_configuration.model_count.one
source: 1 Model
zh_hans: 1 个模型

# provider_configuration.model_id
source: Model ID
zh_hans: 模型 ID

# provider_configuration.refresh
source: Refresh
zh_hans: 刷新

# provider_configuration.refresh_models
source: Refresh Models
zh_hans: 刷新模型

# provider_configuration.refreshing
source: Refreshing
zh_hans: 刷新中

# provider_configuration.section.configuration
source: Configuration
zh_hans: 配置

# provider_configuration.section.models
source: Models
zh_hans: 模型

# provider_field.api_base
source: API Base
zh_hans: API 地址

# provider_field.api_key.placeholder_format
source: %@ API Key
zh_hans: %@ API 密钥

# provider_field.api_version
source: API Version
zh_hans: API 版本

# provider_field.key
source: Key
zh_hans: 密钥

# provider_field.max_tokens
source: Max Tokens
zh_hans: 最大 Token 数

# provider_field.name
source: Name
zh_hans: 名称

# provider_field.tools
source: Tools
zh_hans: 工具

# providers.add_provider
source: Add Provider
zh_hans: 添加服务商

# providers.error.fake_unsupported_model_format
source: Fake provider does not support model: %@
zh_hans: 模拟服务商不支持模型：%@

# providers.error.gemini_blocked_prompt_format
source: Gemini blocked the prompt: %@
zh_hans: Gemini 已拦截提示词：%@。

# providers.error.gemini_stopped_generation_format
source: Gemini stopped generation: %@
zh_hans: Gemini 已停止生成：%@。

# providers.error.http_status_format
source: %@ returned HTTP %ld.
zh_hans: %1$@ 返回 HTTP %2$ld。

# providers.error.http_status_message_format
source: %@ returned HTTP %ld: %@
zh_hans: %1$@ 返回 HTTP %2$ld：%3$@

# providers.error.invalid_api_base_format
source: Invalid API Base: %@
zh_hans: API 地址无效：%@

# providers.error.invalid_max_tokens
source: Max Tokens must be a positive integer.
zh_hans: 最大 Token 数必须为正整数。

# providers.error.invalid_response_format
source: %@ returned an invalid response.
zh_hans: %@ 返回的响应无效。

# providers.error.missing_api_base_format
source: Add an API base for %@ in Settings first.
zh_hans: %@ 需要先在设置中填写 API 地址。

# providers.error.missing_api_key_format
source: Add an API key for %@ in Settings first.
zh_hans: %@ 需要先在设置中填写 API 密钥。

# providers.error.missing_attachment_data_format
source: Unable to load attachment data for %@.
zh_hans: 无法加载附件数据：%@。

# providers.error.no_registered
source: No LLM providers are registered.
zh_hans: 尚未注册模型服务商。

# providers.error.pollinations_payment_required
source: %@ returned HTTP 402. Pollen balance or API key budget is exhausted.
zh_hans: %@ 返回 HTTP 402。Pollen 余额或 API 密钥额度已用完。

# providers.error.pollinations_payment_required_message_format
source: %@ returned HTTP 402: %@. Pollen balance or API key budget is exhausted.
zh_hans: %1$@ 返回 HTTP 402：%2$@。Pollen 余额或 API 密钥额度已用完。

# providers.error.pollinations_rate_limited
source: %@ returned HTTP 429. Rate limit exceeded.
zh_hans: %@ 返回 HTTP 429。请求过于频繁。

# providers.error.pollinations_rate_limited_message_format
source: %@ returned HTTP 429: %@. Rate limit exceeded.
zh_hans: %1$@ 返回 HTTP 429：%2$@。请求过于频繁。

# providers.error.pollinations_unauthorized
source: %@ returned HTTP 401. Add a Pollinations API key or use a model/endpoint that allows anonymous access.
zh_hans: %@ 返回 HTTP 401。请添加 Pollinations API 密钥，或改用允许匿名访问的模型/端点。

# providers.error.pollinations_unauthorized_message_format
source: %@ returned HTTP 401: %@. Add a Pollinations API key or use a model/endpoint that allows anonymous access.
zh_hans: %1$@ 返回 HTTP 401：%2$@。请添加 Pollinations API 密钥，或改用允许匿名访问的模型/端点。

# providers.error.unable_to_add
source: Unable to Add Provider
zh_hans: 无法添加服务商

# providers.error.unsupported_file_attachments_format
source: File attachments are not supported by %@.
zh_hans: %@ 不支持文件附件。

# providers.error.unsupported_format
source: Unsupported LLM provider: %@
zh_hans: 不支持的模型服务商：%@

# providers.fake.display_name
source: Fake
zh_hans: 模拟

# providers.fake.model.markdown_math_static
source: Markdown Math Static
zh_hans: Markdown 公式静态回复

# providers.fake.model.markdown_math_stream
source: Markdown Math Stream
zh_hans: Markdown 公式流式回复

# providers.fake.model.markdown_static
source: Markdown Static
zh_hans: Markdown 静态回复

# providers.fake.model.markdown_stream
source: Markdown Stream
zh_hans: Markdown 流式回复

# providers.fake.model.static
source: Static
zh_hans: 静态回复

# providers.fake.model.stream
source: Stream
zh_hans: 流式回复

# providers.fake.static_response
source: This is a fake static response returned after a short delay.
zh_hans: 这是一条模拟的静态回复，会在短暂延迟后返回。

# providers.fake.stream_response
source: This is a fake streaming response. It arrives gradually so the streaming UI can be checked without a real provider.
zh_hans: 这是一条模拟的流式回复，会逐步显示，方便在没有真实服务商时检查流式界面。

# providers.no_providers
source: No LLM Providers
zh_hans: 暂无模型服务商

# providers.no_providers.detail
source: Add a provider to start chatting.
zh_hans: 添加模型服务商即可开始对话。

# providers.openai_compatible.display_name
source: OpenAI Compatible
zh_hans: 兼容 OpenAI

# providers.section.providers
source: Providers
zh_hans: 服务商

# providers.summary.free_anonymous_tier
source: Free anonymous tier
zh_hans: 免费匿名访问

# runtime.error.invalid_tool_arguments
source: The model produced invalid tool arguments.
zh_hans: 模型生成的工具参数无效。

# runtime.error.message_could_not_be_edited
source: The message could not be edited.
zh_hans: 无法编辑此消息。

# runtime.error.model_required
source: Select a model first.
zh_hans: 请先选择模型。

# runtime.error.selected_provider_unavailable
source: The selected provider is no longer available.
zh_hans: 所选服务商已不可用。

# runtime.error.serialize_tool_arguments_format
source: Unable to serialize tool arguments for %@.
zh_hans: 无法序列化 %@ 的工具参数。

# runtime.error.tool_execution_failed_format
source: Tool execution failed: %@
zh_hans: 工具执行失败：%@

# settings.background_runtime.title
source: Live Activity (Beta)
zh_hans: 实时活动（beta）

# settings.color_mode.dark
source: Dark
zh_hans: 深色

# settings.color_mode.light
source: Light
zh_hans: 浅色

# settings.color_mode.system
source: Automatic
zh_hans: 跟随系统

# settings.color_mode.title
source: Appearance
zh_hans: 外观

# settings.keep_screen_awake_ai_output.title
source: Keep Awake While Responding
zh_hans: 回复时屏幕常亮

# settings.row.about.title
source: About Us
zh_hans: 关于我们

# settings.row.memories.title
source: Memories
zh_hans: 记忆

# settings.row.permissions.title
source: Permissions
zh_hans: 权限

# settings.row.providers.title
source: LLM Providers
zh_hans: 模型服务商

# settings.row.system_prompts.title
source: System Prompts
zh_hans: 系统提示词

# settings.row.tools.title
source: Tools
zh_hans: 工具

# settings.section.app_and_system
source: App & System
zh_hans: 应用与系统
